In [1]:
#importing the relevant libraries
import pandas as pd
import numpy as np
from sklearn.ensemble import RandomForestClassifier, RandomForestRegressor

In [2]:
#importing the training data
data= pd.read_csv('train_revised.csv')

In [3]:
#importing the test data
train=pd.read_csv('test_questions.csv')

In [4]:
data.head()

,ride_id,seat_number,payment_method,payment_receipt,travel_date,travel_time,travel_from,travel_to,car_type,max_capacity
0,1442,15A,Mpesa,UZUEHCBUSO,17-10-17,7:15,Migori,Nairobi,Bus,49
1,5437,14A,Mpesa,TIHLBUSGTE,19-11-17,7:12,Migori,Nairobi,Bus,49
2,5710,8B,Mpesa,EQX8Q5G19O,26-11-17,7:05,Keroka,Nairobi,Bus,49
3,5777,19A,Mpesa,SGP18CL0ME,27-11-17,7:10,Homa Bay,Nairobi,Bus,49
4,5778,11A,Mpesa,BM97HFRGL9,27-11-17,7:12,Migori,Nairobi,Bus,49

In [5]:
#looking for any null entries
train.isnull().sum()

ride_id         0
travel_date     0
travel_time     0
travel_from     0
travel_to       0
car_type        0
max_capacity    0
dtype: int64

In [6]:
data.isnull().sum()

ride_id            0
seat_number        0
payment_method     0
payment_receipt    0
travel_date        0
travel_time        0
travel_from        0
travel_to          0
car_type           0
max_capacity       0
dtype: int64

In [7]:
rides=data['ride_id'].value_counts()
rides1=train['ride_id'].value_counts()

In [8]:
rides.shape

(6249,)

In [9]:
rides1.shape

(1111,)

In [10]:
rides.head()

8454     50
8090     49
10834    49
11382    49
13211    49
Name: ride_id, dtype: int64

In [11]:
#combining the day and date columns
data['daytime']=data['travel_date']+' '+data['travel_time']

In [12]:
train['daytime']=train['travel_date']+' '+train['travel_time']

In [13]:
#converting to date time
data['daytime']=pd.to_datetime(data['daytime'])
train['daytime']=pd.to_datetime(train['daytime'])

In [14]:
data.dtypes

ride_id                     int64
seat_number                object
payment_method             object
payment_receipt            object
travel_date                object
travel_time                object
travel_from                object
travel_to                  object
car_type                   object
max_capacity                int64
daytime            datetime64[ns]
dtype: object

In [15]:
train.dtypes

ride_id                  int64
travel_date             object
travel_time             object
travel_from             object
travel_to               object
car_type                object
max_capacity             int64
daytime         datetime64[ns]
dtype: object

In [16]:
data.head()

,ride_id,seat_number,payment_method,payment_receipt,travel_date,travel_time,travel_from,travel_to,car_type,max_capacity,daytime
0,1442,15A,Mpesa,UZUEHCBUSO,17-10-17,7:15,Migori,Nairobi,Bus,49,2017-10-17 07:15:00
1,5437,14A,Mpesa,TIHLBUSGTE,19-11-17,7:12,Migori,Nairobi,Bus,49,2017-11-19 07:12:00
2,5710,8B,Mpesa,EQX8Q5G19O,26-11-17,7:05,Keroka,Nairobi,Bus,49,2017-11-26 07:05:00
3,5777,19A,Mpesa,SGP18CL0ME,27-11-17,7:10,Homa Bay,Nairobi,Bus,49,2017-11-27 07:10:00
4,5778,11A,Mpesa,BM97HFRGL9,27-11-17,7:12,Migori,Nairobi,Bus,49,2017-11-27 07:12:00

In [17]:
#extracting the weekday name
data['travel_day']=data['daytime'].dt.weekday_name
train['travel_day']=train['daytime'].dt.weekday_name

In [18]:
#exracting the hour of travel
data['travel_hour']=data['daytime'].dt.hour
train['travel_hour']=train['daytime'].dt.hour

In [19]:
data['travel_hour'].value_counts()

7     29205
8      4709
10     4605
19     4369
9      3692
6      2438
5      1515
11      620
23      492
Name: travel_hour, dtype: int64

In [20]:
data['travel_day'].value_counts(normalize=True)

Wednesday    0.159880
Tuesday      0.154787
Thursday     0.150934
Friday       0.144777
Monday       0.134224
Sunday       0.132578
Saturday     0.122819
Name: travel_day, dtype: float64

In [21]:
#droping the payment method column
data=data.drop('payment_method',axis=1)

In [22]:
data=data.drop('payment_receipt',axis=1)

In [23]:
data=data.drop('daytime',axis=1)

In [24]:
train=train.drop('travel_date',axis=1)

In [25]:
train=train.drop('daytime',axis=1)

In [26]:
data=data.drop('seat_number',axis=1)

In [27]:
data=data.drop('car_type',axis=1)

In [28]:
train=train.drop('car_type',axis=1)

In [29]:
data=data.drop('travel_to',axis=1)

In [30]:
train=train.drop('travel_to',axis=1)

In [31]:
data=data.drop('travel_date',axis=1)

In [32]:
data=data.drop('travel_time',axis=1)

In [33]:
train=train.drop('travel_time',axis=1)

In [34]:
#creating a tickets column with a value of 1 on each row
data['tickets']=1

In [35]:
data.head()

   ride_id travel_from  max_capacity travel_day  travel_hour  tickets
0     1442      Migori            49    Tuesday            7        1
1     5437      Migori            49     Sunday            7        1
2     5710      Keroka            49     Sunday            7        1
3     5777    Homa Bay            49     Monday            7        1
4     5778      Migori            49     Monday            7        1

In [36]:
train.head()

   ride_id travel_from  max_capacity travel_day  travel_hour
0      247       Kisii            49     Monday            7
1      256       Kisii            11     Sunday           11
2      275       Kisii            11     Friday            5
3      285       Kisii            11     Friday            9
4      286       Kisii            11     Friday            9

In [37]:
#do a mapping on this... use 1 and 2 for the values.
data['max_capacity'].value_counts(normalize=True)

49    0.619324
11    0.380676
Name: max_capacity, dtype: float64

In [38]:
data['travel_from'].value_counts()

Kisii        22607
Migori        7027
Homa Bay      6304
Sirare        4449
Rongo         3928
Kehancha      1909
Awendo        1788
Kijauri       1031
Keroka         988
Nyachenge      512
Rodi           405
Mbita          378
Ndhiwa         236
Sori            55
Keumbu          22
Oyugis           5
Kendu Bay        1
Name: travel_from, dtype: int64

In [39]:
# mapping the days of travel 
mapping={'Monday':1, 'Tuesday':2, 'Wednesday':3,'Thursday':4,'Friday':5, 'Saturday':6,'Sunday':7}
data['travel_day']=data['travel_day'].map(mapping)
data.head()

   ride_id travel_from  max_capacity  travel_day  travel_hour  tickets
0     1442      Migori            49           2            7        1
1     5437      Migori            49           7            7        1
2     5710      Keroka            49           7            7        1
3     5777    Homa Bay            49           1            7        1
4     5778      Migori            49           1            7        1

In [40]:
train['travel_day']=train['travel_day'].map(mapping)
train.head()

   ride_id travel_from  max_capacity  travel_day  travel_hour
0      247       Kisii            49           1            7
1      256       Kisii            11           7           11
2      275       Kisii            11           5            5
3      285       Kisii            11           5            9
4      286       Kisii            11           5            9

In [41]:
#mapping the orign
mapping1={'Kisii':1,'Migori':2,'Homa Bay':3,'Sirare':4, 'Rongo':5,'Kehancha':6,'Awendo':7,'Kijauri':8,'Keroka':9,'Nyachenge':10,
         'Rodi':11,'Mbita':12,'Ndhiwa':13,'Sori':14,'Keumbu':15,'Oyugis':16,'Kendu Bay':17}
data['travel_from']=data['travel_from'].map(mapping1)

In [42]:
train['travel_from']=train['travel_from'].map(mapping1)
train.head()

   ride_id  travel_from  max_capacity  travel_day  travel_hour
0      247            1            49           1            7
1      256            1            11           7           11
2      275            1            11           5            5
3      285            1            11           5            9
4      286            1            11           5            9

In [43]:
#mapping2={11:1,49:2}
#data['max_capacity']=data['max_capacity'].map(mapping2)

In [44]:
#train['max_capacity']=train['max_capacity'].map(mapping2)

In [45]:
train['travel_hour'].value_counts()

7     482
10    155
6      96
8      85
23     81
9      69
11     52
5      49
19     42
Name: travel_hour, dtype: int64

In [46]:
#mapping the travel hour
mapping3={7:1,8:2,10:3,19:4,9:5,6:6,5:7,11:8,23:9}
data['travel_hour']=data['travel_hour'].map(mapping3)

In [47]:
train['travel_hour']=train['travel_hour'].map(mapping3)

In [48]:
data.head()

   ride_id  travel_from  max_capacity  travel_day  travel_hour  tickets
0     1442            2            49           2            1        1
1     5437            2            49           7            1        1
2     5710            9            49           7            1        1
3     5777            3            49           1            1        1
4     5778            2            49           1            1        1

In [49]:
train.head()

   ride_id  travel_from  max_capacity  travel_day  travel_hour
0      247            1            49           1            1
1      256            1            11           7            8
2      275            1            11           5            7
3      285            1            11           5            5
4      286            1            11           5            5

In [50]:
#aggregating the columns by grouping them by the ride id and origin
view1=data.groupby(['ride_id','travel_from'],as_index=False).agg({'max_capacity':'mean', 'travel_day':'mean',
                                                  'travel_hour':'mean','tickets':'sum'})

In [51]:
view2=train.groupby(['ride_id','travel_from'],as_index=False).agg({'max_capacity':'mean', 'travel_day':'mean',
                                                  'travel_hour':'mean'})

In [52]:
view1=pd.DataFrame(view1)
#view1.head()

In [53]:
#finding the portion of the vehicle that was booked 
view1['cap']=view1['tickets']/view1['max_capacity']

In [54]:
ans=view2['ride_id']

In [55]:
ans.head()

0    247
1    256
2    275
3    285
4    286
Name: ride_id, dtype: int64

In [56]:
#view2=view2.drop('ride_id', axis=1)

In [57]:
view1.head()

,ride_id,travel_from,max_capacity,travel_day,travel_hour,tickets,cap
0,1442,2,49,2,1,1,0.020408
1,5437,2,49,7,1,1,0.020408
2,5710,9,49,7,1,1,0.020408
3,5777,3,49,1,1,5,0.102041
4,5778,2,49,1,1,31,0.632653

In [58]:
view2.head()

   ride_id  travel_from  max_capacity  travel_day  travel_hour
0      247            1            49           1            1
1      256            1            11           7            8
2      275            1            11           5            7
3      285            1            11           5            5
4      286            1            11           5            5

In [59]:
view1=view1.drop('tickets',axis=1)

In [60]:
view1=view1.drop('ride_id',axis=1)

In [61]:
target=view1.cap

In [62]:
view1=view1.drop('cap', axis=1)

In [63]:
view2=view2.drop('ride_id', axis=1)

In [64]:
#extraction of the values to be used in training the model
data=view1.values
target=target.values

In [65]:
view2.head()

   travel_from  max_capacity  travel_day  travel_hour
0            1            49           1            1
1            1            11           7            8
2            1            11           5            7
3            1            11           5            5
4            1            11           5            5

In [66]:
#view3=view2.copy()

In [67]:
#view2=view2.drop('ride_id',axis=1)

In [68]:
test=view2.values

In [69]:
#istanciating the Random forest regressor, fitting of the model and prediction
random_forest = RandomForestRegressor(n_estimators=100)
random_forest.fit(data, target)
pred = random_forest.predict(test)

In [70]:
#creating a dataframe for the predition
ans1=pd.DataFrame(pred, columns=['cap'])

In [71]:
ans1.head()

        cap
0  0.146781
1  0.652464
2  0.200845
3  0.792597
4  0.792597

In [72]:
#concatinating the test data with the predicted data
new=pd.concat([view2,ans1], axis=1)

In [73]:
new2=pd.concat([ans,new], axis=1)

In [74]:
new2.isnull().sum()

ride_id         0
travel_from     0
max_capacity    0
travel_day      0
travel_hour     0
cap             0
dtype: int64

In [75]:
new2.head()

   ride_id  travel_from  max_capacity  travel_day  travel_hour       cap
0      247            1            49           1            1  0.146781
1      256            1            11           7            8  0.652464
2      275            1            11           5            7  0.200845
3      285            1            11           5            5  0.792597
4      286            1            11           5            5  0.792597

In [76]:
#rounding off the prediction to whole numbers
new2['number of tickets']=round(new2['max_capacity']*new2['cap'],0)

In [77]:
new2=new2.drop('cap',axis=1)

In [78]:
#creating a csv file to store your output
new2.to_csv('submission2.csv', index=False, sep=',')